20260630T084756--stuff-at-work__learning_stuff_work.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-07-22 Wed 13:31 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>stuff at work</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">stuff at work</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org29d52df"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-06-30 Tue&gt; </span></span> asked to watch priyanka chopra video i.e https://youtu.be/N9ilrWpJxJM</a>
<ul>
<li><a href="#orgd166288">notebooklm summarised it as follows</a></li>
<li><a href="#org9551712">The Definition of True Education</a></li>
<li><a href="#org57da47b">Investing in the Mind</a></li>
<li><a href="#orga5f3cfd">Reframing Failure</a></li>
<li><a href="#org7e15adf">Mastery Through Teaching</a></li>
<li><a href="#org0874d6a">Final Call to Action</a></li>
</ul>
</li>
<li><a href="#orgbaf90a9">checklist for travel</a>
<ul>
<li><a href="#org5c1ae99">phone x 2</a></li>
<li><a href="#orga1f8b64">charger x 2</a></li>
<li><a href="#org97b5ddd">powerbank</a></li>
<li><a href="#orgc8a7713">stapler</a></li>
<li><a href="#org3eaef26">4 jodi uw</a></li>
<li><a href="#orgcb6c3ea">socks 4</a></li>
<li><a href="#org71d1536">shoes</a></li>
<li><a href="#orgbc733bf">sandal</a></li>
<li><a href="#org41f4795">soap</a></li>
<li><a href="#org0e157ae">perfume</a></li>
<li><a href="#orgffa8043">sunscreen</a></li>
<li><a href="#org4ba9909">kindle</a></li>
<li><a href="#org56bba97">trimmer</a></li>
<li><a href="#orgc94b6b0">kerchiefs</a></li>
<li><a href="#orgd87d6a3">brush</a></li>
<li><a href="#org4b90f83">toothpaser</a></li>
<li><a href="#orgfd816dd">mouthwash</a></li>
<li><a href="#orgc230cd2">nycil</a></li>
<li><a href="#orgbe5968f">envelope</a></li>
<li><a href="#org51b49cc">supplements</a></li>
<li><a href="#org1c3490f">wallet with id</a></li>
<li><a href="#orgd96fa90">small bag and big bag</a></li>
<li><a href="#org0b11003">traveller bag</a></li>
<li><a href="#orgfdf5b22">shorts</a></li>
<li><a href="#org82fef57">track pants</a></li>
<li><a href="#org12f9c0e">jeans</a></li>
<li><a href="#org64f0809">extensions</a></li>
<li><a href="#org4baa92d">plastic bags</a></li>
<li><a href="#org36689c3"></a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-org29d52df" class="outline-2">
<h2 id="org29d52df"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-06-30 Tue&gt; </span></span> asked to watch priyanka chopra video i.e <a href="https://youtu.be/N9ilrWpJxJM">https://youtu.be/N9ilrWpJxJM</a></h2>
<div class="outline-text-2" id="text-org29d52df">
</div>
<div id="outline-container-orgd166288" class="outline-3">
<h3 id="orgd166288">notebooklm summarised it as follows</h3>
<div class="outline-text-3" id="text-orgd166288">
<p>
The core message of this video is that the most dangerous thing a person can do is stop learning, because the moment growth ceases, a person becomes replaceable, irrelevant, and forgotten. Today's world is evolving so rapidly through technology and new ideas that sticking to outdated knowledge is compared to refusing to upgrade an old flip phone; you simply become disconnected from a world that has moved on.
</p>

<p>
The speech highlights several key themes regarding lifelong education and personal evolution:
</p>
</div>
</div>

<div id="outline-container-org9551712" class="outline-3">
<h3 id="org9551712">The Definition of True Education</h3>
<div class="outline-text-3" id="text-org9551712">
<ul class="org-ul">
<li>Curiosity over Degrees: Education is not about academic credentials but about waking up every day with the curiosity to be better than you were yesterday.</li>
<li>Life as a Classroom: Real lessons are often found outside of textbooks—in conversations, heartbreak, managing money, and the strength it takes to get back up after a loss.</li>
<li>Real-World Application: A person with straight A's may still struggle if they cannot adapt to the unpredictable nature of reality or handle failure when things do not go as planned.</li>
</ul>
</div>
</div>
<div id="outline-container-org57da47b" class="outline-3">
<h3 id="org57da47b">Investing in the Mind</h3>
<div class="outline-text-3" id="text-org57da47b">
<ul class="org-ul">
<li>Knowledge vs. Materialism: People often spend thousands on luxury bags or designer clothes to look successful, yet they hesitate to spend money on a book or course that could actually build their future.</li>
<li>Lifelong Value: Fashion trends fade and money can be lost, but knowledge is an investment that always appreciates, compounds over time, and grants access to places where real opportunities exist.</li>
</ul>
</div>
</div>
<div id="outline-container-orga5f3cfd" class="outline-3">
<h3 id="orga5f3cfd">Reframing Failure</h3>
<div class="outline-text-3" id="text-orga5f3cfd">
<ul class="org-ul">
<li>A Component of Success: Failure is not the opposite of success; it is a vital part of it. It acts as a fire that forges strength and a teacher that builds resilience.</li>
<li>The "Not Yet" Mindset: Instead of saying "I'm not good at this," adopting the phrase "I'm not good at this yet" acknowledges that growth is possible through repetition and patience.</li>
<li>Legendary Examples: Icons like Steve Jobs, Walt Disney, and Michael Jordan all faced major rejections or failures but used them as stepping stones rather than roadblocks.</li>
</ul>
</div>
</div>
<div id="outline-container-org7e15adf" class="outline-3">
<h3 id="org7e15adf">Mastery Through Teaching</h3>
<div class="outline-text-3" id="text-org7e15adf">
<ul class="org-ul">
<li>Reinforced Learning: The fastest way to master a skill is to teach it to someone else. Teaching forces you to simplify complex ideas and see gaps in your own understanding.</li>
<li>Transforming Information: By sharing what you know, you turn temporary information into permanent wisdom and belief. You do not need to be a world-class expert to start; you just need to be one step ahead of someone else.</li>
</ul>
</div>
</div>
<div id="outline-container-org0874d6a" class="outline-3">
<h3 id="org0874d6a">Final Call to Action</h3>
<div class="outline-text-3" id="text-org0874d6a">
<p>
To reach your greatest potential, you must be willing to be uncomfortable as a beginnery and obsessed with self-improvement. The speech urges you to change what you consume, surround yourself with people who challenge your thinking, and never stop being a student because the world is waiting for the best version of you.
</p>
</div>
</div>
</div>
<div id="outline-container-orgbaf90a9" class="outline-2">
<h2 id="orgbaf90a9">checklist for travel</h2>
<div class="outline-text-2" id="text-orgbaf90a9">
</div>
<div id="outline-container-org5c1ae99" class="outline-3">
<h3 id="org5c1ae99">phone x 2</h3>
</div>
<div id="outline-container-orga1f8b64" class="outline-3">
<h3 id="orga1f8b64">charger x 2</h3>
</div>
<div id="outline-container-org97b5ddd" class="outline-3">
<h3 id="org97b5ddd">powerbank</h3>
</div>
<div id="outline-container-orgc8a7713" class="outline-3">
<h3 id="orgc8a7713">stapler</h3>
</div>
<div id="outline-container-org3eaef26" class="outline-3">
<h3 id="org3eaef26">4 jodi uw</h3>
</div>
<div id="outline-container-orgcb6c3ea" class="outline-3">
<h3 id="orgcb6c3ea">socks 4</h3>
</div>
<div id="outline-container-org71d1536" class="outline-3">
<h3 id="org71d1536">shoes</h3>
</div>
<div id="outline-container-orgbc733bf" class="outline-3">
<h3 id="orgbc733bf">sandal</h3>
</div>
<div id="outline-container-org41f4795" class="outline-3">
<h3 id="org41f4795">soap</h3>
</div>
<div id="outline-container-org0e157ae" class="outline-3">
<h3 id="org0e157ae">perfume</h3>
</div>
<div id="outline-container-orgffa8043" class="outline-3">
<h3 id="orgffa8043">sunscreen</h3>
</div>
<div id="outline-container-org4ba9909" class="outline-3">
<h3 id="org4ba9909">kindle</h3>
</div>
<div id="outline-container-org56bba97" class="outline-3">
<h3 id="org56bba97">trimmer</h3>
</div>
<div id="outline-container-orgc94b6b0" class="outline-3">
<h3 id="orgc94b6b0">kerchiefs</h3>
</div>
<div id="outline-container-orgd87d6a3" class="outline-3">
<h3 id="orgd87d6a3">brush</h3>
</div>
<div id="outline-container-org4b90f83" class="outline-3">
<h3 id="org4b90f83">toothpaser</h3>
</div>
<div id="outline-container-orgfd816dd" class="outline-3">
<h3 id="orgfd816dd">mouthwash</h3>
</div>
<div id="outline-container-orgc230cd2" class="outline-3">
<h3 id="orgc230cd2">nycil</h3>
</div>
<div id="outline-container-orgbe5968f" class="outline-3">
<h3 id="orgbe5968f">envelope</h3>
</div>
<div id="outline-container-org51b49cc" class="outline-3">
<h3 id="org51b49cc">supplements</h3>
</div>
<div id="outline-container-org1c3490f" class="outline-3">
<h3 id="org1c3490f">wallet with id</h3>
</div>
<div id="outline-container-orgd96fa90" class="outline-3">
<h3 id="orgd96fa90">small bag and big bag</h3>
</div>
<div id="outline-container-org0b11003" class="outline-3">
<h3 id="org0b11003">traveller bag</h3>
</div>
<div id="outline-container-orgfdf5b22" class="outline-3">
<h3 id="orgfdf5b22">shorts</h3>
</div>
<div id="outline-container-org82fef57" class="outline-3">
<h3 id="org82fef57">track pants</h3>
</div>
<div id="outline-container-org12f9c0e" class="outline-3">
<h3 id="org12f9c0e">jeans</h3>
</div>
<div id="outline-container-org64f0809" class="outline-3">
<h3 id="org64f0809">extensions</h3>
</div>
<div id="outline-container-org4baa92d" class="outline-3">
<h3 id="org4baa92d">plastic bags</h3>
</div>
<div id="outline-container-org36689c3" class="outline-3">
<h3 id="org36689c3"></h3>
</div>
</div>
</div>
</body>
</html>